[
  {
    "id": "1",
    "title": "Animation Class Launched!",
    "image": "assets/img/animation.png",
    "summary": "Aidoko launches a new animation class for creative minds.",
 "content": "This animation class is for children aged 8 to 17 with basic computer operation knowledge. The class is designed to equip children with basic industry animation skills to help them come out in the financial market readily available with the necessary skills. <a href='animation-registration.html' style='color:#ff9800;font-weight:bold;text-decoration:underline;'>Register now to secure your spot!</a><br><br>The world is rapidly becoming a digital world, and staying on top is necessary to avoid being thrown out of jobs, especially now that AI is taking human jobs. Click the link <a href='animation-registration.html' style='color:#ff9800;font-weight:bold;text-decoration:underline;'>Register now to secure your spot!</a> to register your wards and kids.","date": "2025-08-17"
  },
  {
    "id": "2",
    "title": "Learn How to do 3D Animating With AI ",
    "image": "assets/img/man_standing.JPG",
    "summary": "Blender (main platform), Mixamo and Plask, Point-E for AI-generated 3D objects",
     "content": "🎨✨ <b>Why You Should Learn 3D Animation Today – 100% Free!</b> ✨🎨 <br><br>The world of creativity is changing fast, and animation is now one of the most powerful skills anyone can have. From blockbuster movies to video games, education, advertising, and even climate change awareness campaigns, animation is everywhere. <br><br>The best part? You don’t need to spend huge amounts of money to learn it—there is a <b>100% free workflow</b> that allows you and your children to dive into professional animation right away! <br><br><b>Here’s the powerful workflow we’ll guide you through:</b><br><br>✅ <b>Use Blender (Main Platform)</b> – Blender is a world-class, free 3D software used by professionals in film and gaming. With it, you can model, animate, and render like the pros. <br><br>✅ <b>Import Free Animations from Mixamo</b> – Instead of spending weeks rigging characters from scratch, Mixamo (totally free) lets you instantly add lifelike animations and rigging to your characters. <br><br>✅ <b>Use Plask or Radical Motion (Free Motion Capture)</b> – With just a simple video, you can bring characters to life using motion capture—making them walk, dance, or run exactly like a real human. <br><br>✅ <b>Experiment with Point-E (AI for 3D Objects)</b> – Imagine typing a text prompt like “a futuristic car” or “African cultural mask,” and AI generates a 3D object for you to refine in Blender. That’s the future—available now for free! <br><br><b>🎯 Why Learn Animation?</b><br> - Kids improve <b>creativity, logic, and problem-solving</b>.<br> - Parents and youths gain <b>high-demand digital skills</b>.<br> - Opportunities in <b>gaming, film, advertising, and tech</b> are endless. <br><br>💡 This free workflow removes every barrier—no expensive software, no hidden costs—just pure creativity and growth. <br><br>👉 <b>Register now and start your journey into the exciting world of animation! <a href='https://docs.google.com/forms/d/e/1FAIpQLSe_r2NOWatRTy--RsFbpY29614AL4A1V5I_dfYbboCr1tyjUw/viewform?usp=pp_url' style='color:#ff9800;font-weight:bold;text-decoration:underline;'>Register Here</a></b>",
    "date": "2025-08-16"
  },
  {
  "id": "3",
  "title": "Unlock Your Future: Python Coding Classes Now Open!",
  "image": "assets/img/python.png",
  "summary": "Discover why Python is essential for both kids and adults. Registration for our Python coding class is now open!",
  "content": "In today’s fast-changing digital world, learning to code is no longer just an advantage—it is a necessity. Among all programming languages, <strong>Python</strong> stands out as one of the most powerful, beginner-friendly, and widely used languages across the globe. From building fun games to developing websites, automating tasks, and even creating Artificial Intelligence and Machine Learning solutions, Python opens up endless opportunities for both adults and children.<br><br>For children especially, learning Python does much more than teaching them how to code. It sharpens their reasoning ability, boosts problem-solving skills, and enhances creativity. Studies have shown that kids who engage in coding activities often perform better in school because they learn to think critically, break problems into smaller parts, and find logical solutions. These are skills that extend far beyond the classroom—helping them excel in mathematics, science, and even real-life challenges.<br><br>Parents too can benefit greatly from learning Python. It allows you to stay on top of the digital revolution, equipping you with skills that are relevant in today’s job market. Whether you want to switch careers, improve your business with technology, or simply keep pace with the fast-moving tech world, Python is a tool you cannot afford to ignore.<br><br>By registering yourself and your child for Python coding classes, you are investing in a future filled with innovation, intelligence, and opportunity. Together, you and your child can explore the fascinating world of coding—building games, apps, and even smart projects that can make a difference.<br><br><strong>Give your child the gift of coding today and watch as their brilliance and confidence grow. Don’t be left behind—the future is digital, and it starts with Python.</strong><br><br><a href='python-registration.html' style='color:#ff9800;font-weight:bold;text-decoration:underline;'>Register now for the Python class!</a>",
  "date": "2025-08-17"
},
{
    "id": "4",
    "title": "🎬 3D Animation Class Plan (Using Blender)",
    "image": "assets/img/tara-duncan-animation.gif",
    "summary": "Join our comprehensive Blender 3D animation class and become part of a movie development team! Registration and payment now open.",
    "content": "<strong>Objectives</strong><br>Train participants in 3D modeling, rigging, and animation using Blender.<br>Equip them with industry-standard techniques in animation production.<br>Teach storytelling, whiteboarding, and teamwork for collaborative movie creation.<br>Build a team capable of working on a full animated movie project.<br><br><strong>Target Audience</strong><br>Beginners to intermediate learners interested in animation, game development, or film production.<br>Students, creatives, designers, or anyone passionate about storytelling through 3D animation.<br><br><strong>Curriculum Outline</strong><br><u> <b>Phase 1:</b> Introduction & Foundation</u><br>Overview of Blender & animation industry<br>Navigation, interface, and basic modeling<br>Whiteboarding for story visualization<br><u><b>Phase 2:</b> 3D Modeling</u><br>Creating characters, props, and environments<br>Low-poly vs high-poly modeling<br>Texturing and materials<br><u><b>Phase 3:</b> Rigging</u><br>Skeleton creation & bone structure<br>Weight painting<br>Facial rigging for expressions<br><u><b>Phase 4:</b> Animation</u><br>Principles of animation (timing, squash & stretch, anticipation, etc.)<br>Walk cycles, lip sync, and facial animation<br>Camera movement & cinematics<br><u><b>Phase 5:</b> Storytelling & Teamwork</u><br>Storyboarding and scriptwriting for animation<br>Team roles in production (modeler, rigger, animator, director, etc.)<br>Collaboration workflow with version control (Git, Google Drive, etc.)<br><u><b>Phase 6:</b> Final Project</u><br>Team-based short animation film<br>Premiere & feedback session<br>Certificate of completion<br><br><strong>Duration</strong><br>8 to 12 weeks (depending on depth and number of trainees)<br>Classes: 2–3 sessions per week (online/offline hybrid possible)<br><br><strong>Resources Needed</strong><br>Computers with Blender (free software) installed<br>Internet access (for references & collaboration)<br><br>Storyboarding sheets & notebooks<br><br><strong>Outcomes</strong><br>✅ Model, rig, and animate 3D assets in Blender<br>✅ Collaborate effectively on animation projects<br>✅ Understand industry production pipeline<br>✅ Have a portfolio-ready short animated film<br><br><strong>Long-Term Vision</strong><br>Form a movie development team from the best trainees.<br>Build original short films and eventually full-length animation productions.<br>Position the team for collaboration, funding, and distribution with studios and streaming platforms.<br><br><a href='animation-registration.html' style='color:#ff9800;font-weight:bold;text-decoration:underline;'>Register and Pay Here</a><br><br><strong>Note:</strong> Please upload your payment proof in the registration form online.",
    "date": "2025-08-29"
  },
  {
  "id": "5",
  "title": "Premier League 2025 Summer Transfer Deadline Day: Record Deals & Drama",
  "image": "https://ichef.bbci.co.uk/ace/standard/976/cpsprodpb/385b/live/aa511070-8778-11f0-9ba5-971e818a6b8b.jpg.webp",
  "summary": "Breaking news: Liverpool smash British transfer record for Isak, Premier League clubs spend over £3 billion, and deadline day delivers last-minute twists.",
  "content": "<strong>Here’s your breaking-news style recap of the Premier League’s 2025 summer transfer deadline day, which concluded on September 1, 2025—a day packed with drama, record sums, and last-minute twists.</strong><br><br><strong>Major Headlines</strong><br><ul><li><b>Liverpool make history:</b> Alexander Isak joins from Newcastle in a British record deal (£125–130 million, including add-ons). The prolonged Isak saga ends after weeks of intense negotiation, elevating Liverpool’s summer spending to over £400 million.</li><li><b>Most expensive summer ever:</b> Premier League clubs cracked a £3 billion total outlay, smashing the previous window’s record of £2.36 billion.</li></ul><br><strong>Key Transfers by Club</strong><br><ul><li><b>Liverpool:</b> Signed Florian Wirtz (£116m) and Hugo Ekitike (£69m), adding major firepower alongside Isak. Attempted but failed to sign Marc Guéhi from Crystal Palace.</li><li><b>Manchester United:</b> Signed goalkeeper Senne Lammens (~£18–21m). Offloaded Antony to Real Betis (50% sell-on clause), Rasmus Højlund to Napoli (loan with obligation), and loaned Jadon Sancho to Aston Villa.</li><li><b>Manchester City:</b> Replaced Ederson (sold to Fenerbahçe) by acquiring Gianluigi Donnarumma from PSG (€30m). Loaned Manuel Akanji to Inter Milan.</li><li><b>Chelsea:</b> Loaned Nicolas Jackson to Bayern Munich (option to buy next summer). Recalled Marc Guiu from Sunderland.</li><li><b>Aston Villa:</b> Acquired Harvey Elliott and Jadon Sancho on loan.</li><li><b>Arsenal:</b> Signed Piero Hincapié on loan with a €52m option to buy. Earlier signings: Viktor Gyökeres, Eberechi Eze, Martin Zubimendi.</li><li><b>Fulham:</b> Added Tyrique George, Kevin (club-record €40m), and Samuel Chukwueze; George's deal reportedly collapsed.</li><li><b>Newcastle:</b> Signed Yoane Wissa (£50–55m) as Isak’s replacement. Invested Isak funds into Nick Woltemade.</li><li><b>Tottenham Hotspur:</b> Secured Randal Kolo Muani on loan from PSG.</li></ul><br><strong>Summary Table of Deadline-Day Moves</strong><br><table border='1' cellpadding='4' style='border-collapse:collapse;max-width:100%;'><tr><th>Club</th><th>Notable Deadline-Day Moves</th></tr><tr><td>Liverpool</td><td>Isak (£125-130m), attempted Guéhi, earlier Ekitike & Wirtz</td></tr><tr><td>Man Utd</td><td>In: Lammens, Out: Antony, Højlund, Sancho</td></tr><tr><td>Man City</td><td>In: Donnarumma, Out: Ederson, loaned Akanji</td></tr><tr><td>Chelsea</td><td>Out: Jackson to Bayern (loan), maybe Guiu recalled</td></tr><tr><td>Villa</td><td>In: Sancho, Elliott (loans)</td></tr><tr><td>Arsenal</td><td>In: Hincapié (loan + buy option), earlier summer signings</td></tr><tr><td>Fulham</td><td>In: Kevin, Chukwueze; George deal collapsed</td></tr><tr><td>Newcastle</td><td>In: Wissa, Woltemade; Out: Isak deal</td></tr><tr><td>Tottenham</td><td>In: Kolo Muani (loan)</td></tr></table><br><strong>The Bigger Picture</strong><br>This transfer window was among the most dramatic in Premier League history, setting new spending benchmarks across clubs. With deals exceeding £3 billion in total, Liverpool alone spent £400 million+, and multiple clubs crossed the £200 million threshold in their summer outlays.<br><br>It underscores both the financial muscle of top-tier clubs and the escalating stakes of recruiting top talent—and how volatile deadline day can be.",
  "date": "2025-09-02"
}

]
